lessons/OrganicChemistry/01.org
#+TITLE: 
#+AUTHOR: MKQ
#+KEYWORDS: note
#+LATEX_COMPILER: xelatex
#+LATEX_HEADER:\usepackage[scheme=plain]{ctex}
* 共价键的属性
- C,N,O电负性逐渐上升,半径逐渐减小,所以和H相连时键长不断下降
- 杂化中S轨道成分越多,电负性越大
 - s轨道离原子核更近
- 三元环由于键角偏离正常,变得更加容易断裂
- 键能,是断键释放能量的平均值
- 键解离能,就是断成自由基时需要吸收的能量,对应的是单个键
- 可以通过键能计算反应热,反应物中键能的总和减去生成物中的
** 键的极性
- 原子吸引电子的本领:电负性
极性共价键,非极性共价键,偶极矩来描述共价键的极性
\[
\mu = ed
\]
- e:正电荷中心所带的电荷
- d:正负电荷中心的距离
** - 
** 分子间的作用力
- 偶极-偶极作用力:极性分子之间偶极分子的相互作用
- 色散力:极性分子中基本上没有
- 诱导力:极性分子和非极性分子之间
- 氢键:方向性,饱和性
- 氢键>>偶极-偶极>诱导力>色散力
* 有机化合物的分类
** 碳骨架的分类
 - 开链化合物
 - 环状化合物
   - 脂环,芳环,脂杂环,芳杂环
 - 烷烃,环烷烃的命名,期中考试前考,之后不会考了,只要求对上结构
** 官能团分类
** 共价键的断裂和有机反应的历程
- 自由基反应:均裂,有自由基,自由基是反应中间体的一种,加热光照自由基引发剂
- 离子反应:异裂,酸碱,极性溶剂,溶剂为了增加反应面积,控制温度,
正负离子也是反应中间体的一种
  - 亲电反应:试剂本身缺电子,要和富电子的部分进行结合,这是亲电试剂
  - 亲核反应:试剂本身富电子,和缺电子的位点进行反应
- 协同反应:旧键断裂和新键生成同时发生,没有自由基也没有离子,键的变化比较多
** 酸碱理论
- 酸碱电离理论
水溶液中能电离出氢离子是酸,氢氧根是碱
- 酸碱质子论
可以接受质子的是碱,可以给出的是酸
- 酸碱电子论
可以接受电子的是酸,可以给出电子的是碱
- 软硬酸碱理论
  - 硬酸:体积小,正电荷数高,可极化性低的中心原子
  - 软酸:体积大,正电荷数低,可极化性高的中心原子
  - 硬碱:电负性高,可极化性低,难以被氧化的配位原子
  - 
*** othrs
三氟化硼,由于是气体,不方便使用,所以把它溶解在醚里面,
和醚氧形成络合物,来便于保存.不是简单的溶解哦
* 烷烃
** 分类
烃
\begin{cases}
之后再说吧...
\end{cases}
** 同系物,同分异构体
同系列,就是相差CH_2的化合物,性质很相像,同系列里面的一堆互为同系物
*** 同分异构体
相同分子式
*** 构造异构体
相同分子式,但是官能团连接次序不同
*** 碳架异构
碳骨架不同
*** others
异构体数目随着碳数目的增加而迅速增加
** 烷基的概念
- 一级碳:伯
- 二级碳:仲
- 三级碳:叔
- 四级碳:季
- 在相应的碳上的氢就是相应的伯仲叔季氢
** 烷烃的命名
*** 普通命名法
正,异,新...
*** 系统命名法
- 选取最长的碳链<没有官能团的话>
- 选取代基更多的作为主链
- 取代基一样多的时候...随便吧哈哈哈哈哈哈
- 让取代基的编号,依次最小<不是总和>解决了从左到右还是从右到左编号
- 优先顺序规则
  - 单原子取代基,按照原子序数排列,有同位素按照原子质量
  - 多原子基团,第一个原子相同,那就依次比其它相连的原子
  - 双键,三键,认为连着好几个碳?总之我懂的...
- 支链编号,从与主链相连的碳作为1'
- 如果分子中有多种取代基,那就按照顺序规则,
序列较小的在前,较大的在后




