lessons/OrganicChemistry/01.tex
% Created 2019-09-06 五 09:26
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[scheme=plain]{ctex}
\author{MKQ}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={MKQ},
 pdftitle={},
 pdfkeywords={note},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 9.0.3)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{共价键的属性}
\label{sec:orgac725ff}
\begin{itemize}
\item C,N,O电负性逐渐上升,半径逐渐减小,所以和H相连时键长不断下降
\item 杂化中S轨道成分越多,电负性越大
\begin{itemize}
\item s轨道离原子核更近
\end{itemize}
\item 三元环由于键角偏离正常,变得更加容易断裂
\item 键能,是断键释放能量的平均值
\item 键解离能,就是断成自由基时需要吸收的能量,对应的是单个键
\item 可以通过键能计算反应热,反应物中键能的总和减去生成物中的
\end{itemize}
\subsection{键的极性}
\label{sec:orgecdcaed}
\begin{itemize}
\item 原子吸引电子的本领:电负性
\end{itemize}
极性共价键,非极性共价键,偶极矩来描述共价键的极性
\[
\mu = ed
\]
\begin{itemize}
\item e:正电荷中心所带的电荷
\item d:正负电荷中心的距离
\end{itemize}
\subsection{-}
\label{sec:org0b70e11}
\subsection{分子间的作用力}
\label{sec:orgcc9f5c6}
\begin{itemize}
\item 偶极-偶极作用力:极性分子之间偶极分子的相互作用
\item 色散力:极性分子中基本上没有
\item 诱导力:极性分子和非极性分子之间
\item 氢键:方向性,饱和性
\item 氢键>>偶极-偶极>诱导力>色散力
\end{itemize}
\section{有机化合物的分类}
\label{sec:orga51e610}
\subsection{碳骨架的分类}
\label{sec:org714b047}
\begin{itemize}
\item 开链化合物
\item 环状化合物
\begin{itemize}
\item 脂环,芳环,脂杂环,芳杂环
\end{itemize}
\item 烷烃,环烷烃的命名,期中考试前考,之后不会考了,只要求对上结构
\end{itemize}
\subsection{官能团分类}
\label{sec:orge9e8f3f}
\subsection{共价键的断裂和有机反应的历程}
\label{sec:org4fb12ab}
\begin{itemize}
\item 自由基反应:均裂,有自由基,自由基是反应中间体的一种,加热光照自由基引发剂
\item 离子反应:异裂,酸碱,极性溶剂,溶剂为了增加反应面积,控制温度,
\end{itemize}
正负离子也是反应中间体的一种
\begin{itemize}
\item 亲电反应:试剂本身缺电子,要和富电子的部分进行结合,这是亲电试剂
\item 亲核反应:试剂本身富电子,和缺电子的位点进行反应
\end{itemize}
\begin{itemize}
\item 协同反应:旧键断裂和新键生成同时发生,没有自由基也没有离子,键的变化比较多
\end{itemize}
\subsection{酸碱理论}
\label{sec:org6c24de6}
\begin{itemize}
\item 酸碱电离理论
\end{itemize}
水溶液中能电离出氢离子是酸,氢氧根是碱
\begin{itemize}
\item 酸碱质子论
\end{itemize}
可以接受质子的是碱,可以给出的是酸
\begin{itemize}
\item 酸碱电子论
\end{itemize}
可以接受电子的是酸,可以给出电子的是碱
\begin{itemize}
\item 软硬酸碱理论
\begin{itemize}
\item 硬酸:体积小,正电荷数高,可极化性低的中心原子
\item 软酸:体积大,正电荷数低,可极化性高的中心原子
\item 硬碱:电负性高,可极化性低,难以被氧化的配位原子
\item 
\end{itemize}
\end{itemize}
\subsubsection{othrs}
\label{sec:org6c6d8c5}
三氟化硼,由于是气体,不方便使用,所以把它溶解在醚里面,
和醚氧形成络合物,来便于保存.不是简单的溶解哦
\section{烷烃}
\label{sec:org41b33f5}
\subsection{分类}
\label{sec:orga89143b}
烃
\begin{cases}
之后再说吧...
\end{cases}
\subsection{同系物,同分异构体}
\label{sec:orgf367454}
同系列,就是相差CH\(_{\text{2的化合物,性质很相像,同系列里面的一堆互为同系物}}\)
\subsubsection{同分异构体}
\label{sec:orgc9044bf}
相同分子式
\subsubsection{构造异构体}
\label{sec:org14967da}
相同分子式,但是官能团连接次序不同
\subsubsection{碳架异构}
\label{sec:orge32dfbf}
碳骨架不同
\subsubsection{others}
\label{sec:org0e5e1b5}
异构体数目随着碳数目的增加而迅速增加
\subsection{烷基的概念}
\label{sec:orgb8df238}
\begin{itemize}
\item 一级碳:伯
\item 二级碳:仲
\item 三级碳:叔
\item 四级碳:季
\item 在相应的碳上的氢就是相应的伯仲叔季氢
\end{itemize}
\subsection{烷烃的命名}
\label{sec:orgb41e59e}
\subsubsection{普通命名法}
\label{sec:org34644d5}
正,异,新\ldots{}
\subsubsection{系统命名法}
\label{sec:org7bde0de}
\begin{itemize}
\item 选取最长的碳链<没有官能团的话>
\item 选取代基更多的作为主链
\item 取代基一样多的时候\ldots{}随便吧哈哈哈哈哈哈
\item 让取代基的编号,依次最小<不是总和>解决了从左到右还是从右到左编号
\item 优先顺序规则
\begin{itemize}
\item 单原子取代基,按照原子序数排列,有同位素按照原子质量
\item 多原子基团,第一个原子相同,那就依次比其它相连的原子
\item 双键,三键,认为连着好几个碳?总之我懂的\ldots{}
\end{itemize}
\item 支链编号,从与主链相连的碳作为1'
\item 如果分子中有多种取代基,那就按照顺序规则,
\end{itemize}
序列较小的在前,较大的在后
\end{document}
